onec/omni/src/extension/бит_МедицинаОмни_ПРОФ/Catalogs/бит_омни_Боты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_омни_Боты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Токен</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Канал</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_омни_КаналыСвязи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НапоминатьЗаЧасовMAX</Name>
					<Comment>Устаревшая одиночная настройка. Используется только для переноса значения в список интервалов.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИнтервалыНапоминанийMAX</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЧасовДоПриема</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

onec/omni/src/extension/бит_МедицинаОмни_ПРОФ/Catalogs/бит_омни_Боты/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура бит_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	//+бит_Сафаров ШИ 01.09.2026
	Если Объект.ИнтервалыНапоминанийMAX.Количество() = 0
		И Объект.НапоминатьЗаЧасовMAX > 0 Тогда
		СтрокаИнтервала = Объект.ИнтервалыНапоминанийMAX.Добавить();
		СтрокаИнтервала.ЧасовДоПриема = Объект.НапоминатьЗаЧасовMAX;
	КонецЕсли;
	//-бит_Сафаров ШИ 01.09.2026

КонецПроцедуры

&НаСервере
Процедура бит_ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	//+бит_Сафаров ШИ 01.09.2026
	УникальныеИнтервалы = Новый Соответствие;
	Для Каждого СтрокаИнтервала Из ТекущийОбъект.ИнтервалыНапоминанийMAX Цикл
		ЧасовДоПриема = СтрокаИнтервала.ЧасовДоПриема;
		Если ЧасовДоПриема <= 0 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru='Интервал напоминания должен быть больше нуля.'");
			Сообщение.Поле = "Объект.ИнтервалыНапоминанийMAX";
			Сообщение.Сообщить();
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		Если УникальныеИнтервалы.Получить(ЧасовДоПриема) <> Неопределено Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон(
				НСтр("ru='Интервал %1 ч указан несколько раз. Оставьте только одну строку.'"),
				ЧасовДоПриема);
			Сообщение.Поле = "Объект.ИнтервалыНапоминанийMAX";
			Сообщение.Сообщить();
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		УникальныеИнтервалы.Вставить(ЧасовДоПриема, Истина);
	КонецЦикла;

	ТекущийОбъект.НапоминатьЗаЧасовMAX = 0;
	//-бит_Сафаров ШИ 01.09.2026

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИнформациюОБоте(Команда)
	ЗаполнитьИнформациюОБотеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРассылкиЗаписей(Команда)

	Если Объект.Канал <> ПредопределенноеЗначение("Перечисление.бит_омни_КаналыСвязи.MAX") Тогда
		ПоказатьПредупреждение(, НСтр("ru='Выберите канал MAX.'"));
		Возврат;
	КонецЕсли;

	Если Не Объект.Использовать Тогда
		ПоказатьПредупреждение(, НСтр("ru='Включите флаг Использовать.'"));
		Возврат;
	КонецЕсли;

	Если ПустаяСтрока(Объект.Токен) Тогда
		ПоказатьПредупреждение(, НСтр("ru='Укажите токен MAX.'"));
		Возврат;
	КонецЕсли;

	Попытка
		Записать();
		//+бит_Сафаров ШИ 19.08.2026
		Анализ = ПроанализироватьРассылкиЗаписейНаСервере();
		Если Анализ.Готово Тогда
			ОбеспечитьРегламентноеЗаданиеНаСервере();
			ПоказатьОповещениеПользователя(
				НСтр("ru='Три стандартные рассылки MAX уже настроены и активны.'"));
			Возврат;
		КонецЕсли;

		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить("REPAIR", НСтр("ru='Скорректировать существующие'"));
		Кнопки.Добавить("RECREATE", НСтр("ru='Создать новые и отключить старые'"));
		Кнопки.Добавить("CANCEL", НСтр("ru='Отмена'"));

		ДополнительныеПараметры = Новый Структура("Сигнатура", Анализ.Сигнатура);
		Оповещение = Новый ОписаниеОповещения(
			"СоздатьРассылкиЗаписейПослеВыбораДействия",
			ЭтотОбъект,
			ДополнительныеПараметры);
		ТекстВопроса = Анализ.ТекстПредпросмотра
			+ Символы.ПС + Символы.ПС
			+ НСтр("ru='Старые объекты не удаляются. Во втором варианте отключается только их связь с текущим ботом.'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки);
		//-бит_Сафаров ШИ 19.08.2026
	Исключение
		ПоказатьПредупреждение(, КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;

КонецПроцедуры

//+бит_Сафаров ШИ 19.08.2026
&НаКлиенте
Процедура СоздатьРассылкиЗаписейПослеВыбораДействия(РезультатВыбора, ДополнительныеПараметры) Экспорт

	Если РезультатВыбора = Неопределено Или РезультатВыбора = "CANCEL" Тогда
		Возврат;
	КонецЕсли;

	Попытка
		Результат = СоздатьРассылкиЗаписейНаСервере(
			РезультатВыбора,
			ДополнительныеПараметры.Сигнатура);
		ПоказатьОповещениеПользователя(СтрШаблон(
			НСтр("ru='Готово. Создано: %1, исправлено: %2, активировано: %3, отключено старых: %4, пропущено: %5.'"),
			Результат.Создано,
			Результат.Исправлено,
			Результат.Активировано,
			Результат.Деактивировано,
			Результат.Пропущено));
		Если Результат.Предупреждения.Количество() > 0 Тогда
			ПоказатьПредупреждение(, СтрСоединить(Результат.Предупреждения, Символы.ПС));
		КонецЕсли;
	Исключение
		ПоказатьПредупреждение(, КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;

КонецПроцедуры

&НаСервере
Функция ПроанализироватьРассылкиЗаписейНаСервере()

	Возврат Справочники.бит_омни_Рассылки.ПроанализироватьСтандартныеРассылкиЗаписейMAX(Объект.Ссылка);

КонецФункции

&НаСервере
Функция СоздатьРассылкиЗаписейНаСервере(Режим, Сигнатура)

	Возврат Справочники.бит_омни_Рассылки.ПрименитьСтандартныеРассылкиЗаписейMAX(
		Объект.Ссылка,
		Режим,
		Сигнатура);

КонецФункции

&НаСервере
Процедура ОбеспечитьРегламентноеЗаданиеНаСервере()

	бит_омни_РассылкиMAXСервер.бит_ОбеспечитьРегламентноеЗадание();

КонецПроцедуры
//-бит_Сафаров ШИ 19.08.2026

&НаСервере
Процедура ЗаполнитьИнформациюОБотеНаСервере()
	
	Если Объект.Канал = Перечисления.бит_омни_КаналыСвязи.MAX Тогда
		ДанныеБота = бит_омни_ИнтеграцияСMAX.ИнформацияОБоте(Объект.Токен);
		Если ДанныеБота = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Объект.Идентификатор = Формат(ДанныеБота.user_id, "ЧГ=0");
		Объект.Наименование = Лев(ПредставлениеБотаMAX(ДанныеБота), 150);
		Объект.ИмяПользователя = ИмяПользователяБотаMAX(ДанныеБота);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПредставлениеБотаMAX(ДанныеБота)
	
	Представление = "";
	Если ДанныеБота.Свойство("name", Представление) И ЗначениеЗаполнено(Представление) Тогда
		Возврат СокрЛП(Представление);
	КонецЕсли;
	
	Если ДанныеБота.Свойство("first_name", Представление) И ЗначениеЗаполнено(Представление) Тогда
		Возврат СокрЛП(Представление);
	КонецЕсли;
	
	Возврат ИмяПользователяБотаMAX(ДанныеБота);
	
КонецФункции

&НаСервереБезКонтекста
Функция ИмяПользователяБотаMAX(ДанныеБота)
	
	ИмяПользователя = "";
	Если ДанныеБота.Свойство("username", ИмяПользователя) Тогда
		Возврат СокрЛП(ИмяПользователя);
	КонецЕсли;
	
	Возврат "";
	
КонецФункции
